#ifndef VMC_MESSAGE_TYPES_H
#define VMC_MESSAGE_TYPES_H

#include <stdint.h>
#include <stdbool.h>

// ============================================================================
// ============================================================================

// COMMON HEADER
typedef struct __attribute__((packed)) 
{
    uint8_t  message_identifier;            // Byte 0        | 1 byte
    uint16_t message_len;                   // Byte 1 - 2    | 2 byte
    uint64_t timestamp;                     // Byte 3 - 10   | 8 byte
} vmp_cmsw_header_t;                        // TOPLAM: 11 byte

typedef struct __attribute__((packed)) 
{
    vmp_cmsw_header_t header_st;
} pbit_result_req_mes_t;


// ============================================================================
//
// PBIT REPORT  --  FLCS VL = 10 // VS VL = 13
//
// ============================================================================

// 1. VMP PBIT REPORT STRUCTURES  
typedef struct __attribute__((packed)) 
{
    uint8_t flcs_cpu_status         : 1;    // Byte 449, bit 0
    uint8_t vs_cpu_status           : 1;    // Byte 449, bit 1
    uint8_t eMMC_storage_status     : 1;    // Byte 449, bit 2
    uint8_t MRAM_storage_status     : 1;    // Byte 449, bit 3
    uint8_t reserved                : 4;    // Byte 449, bit 4 - 7
} vmp_storage_and_status_t;                 // TOPLAM: 1 byte

typedef struct __attribute__((packed)) 
{
    uint8_t major;                          // Byte 446        | 1 byte

typedef struct __attribute__((packed)) 
{
    float DTN_FSW_VDD_input_current;            // Byte 309 - 312  | 4 byte
    float DTN_FSW_3v3_rail_input_current;       // Byte 313 - 316  | 4 byte
    float DTN_FSW_FO_F_RX_imon_r;               // Byte 317 - 320  | 4 byte
    float DTN_FSW_1v8_rail_input_current;       // Byte 321 - 324  | 4 byte
    float DTN_FSW_1v3_rail_input_current;       // Byte 325 - 328  | 4 byte
    float DTN_FSW_12V_main_current;             // Byte 329 - 332  | 4 byte
    float DTN_FSW_BM_ADC_3V_1;                  // Byte 333 - 336  | 4 byte
    float DTN_FSW_1V_VDD_rail_voltage;          // Byte 337 - 340  | 4 byte
    float DTN_FSW_2v5_rail_voltage;             // Byte 341 - 344  | 4 byte
    float DTN_FSW_1v8_rail_voltage;             // Byte 345 - 348  | 4 byte
    float DTN_FSW_1V_VDDA_rail_voltage;         // Byte 349 - 352  | 4 byte
    float DTN_FSW_3v3_VDDIX_rail_voltage;       // Byte 353 - 356  | 4 byte
    float DTN_FSW_2v5_rail_input_current;       // Byte 357 - 360  | 4 byte
    float DTN_FSW_12V_main_voltage;             // Byte 361 - 364  | 4 byte
    float DTN_FSW_BM_ADC_3V_2;                  // Byte 365 - 368  | 4 byte
} bm_flcs_dtn_sw_status_data_t;                 // TOPLAM: 60 byte

typedef struct __attribute__((packed)) 
{
    float PSM_PWR_PRI_VOLS;                     // Byte 369 - 372  | 4 byte
    float PSM_PWR_SEC_VOLS;                     // Byte 373 - 376  | 4 byte
    float PSM_INPUT_CURS;                       // Byte 377 - 380  | 4 byte
    float PSM_TEMP;                             // Byte 381 - 384  | 4 byte
    float BM_FPGA_temperature;                  // Byte 385 - 388  | 4 byte
    float Board_edge_temperature;               // Byte 389 - 392  | 4 byte
    float BRD_MNGR_12V_main_current;            // Byte 393 - 396  | 4 byte
} bm_vmc_board_status_data_t;                   // TOPLAM: 28 byte


typedef struct __attribute__((packed)) 
{
    vmp_cmsw_header_t            header_st;              // Byte 0   - 10   | 11 byte
    uint8_t                      lru_id;                 // Byte 11         | 1 byte
    uint8_t                      comm_status;            // Byte 12         | 1 byte
    bm_vs_cpu_status_data_t      vs_status_st;           // Byte 13  - 100  | 88 byte
    bm_flcs_cpu_status_data_t    flcs_status_st;         // Byte 101 - 188  | 88 byte
    bm_dtn_es_status_data_t      dtn_es_status_st;       // Byte 189 - 248  | 60 byte
    bm_vs_dtn_sw_status_data_t   vs_dtn_sw_status_st;    // Byte 249 - 308  | 60 byte
    bm_flcs_dtn_sw_status_data_t flcs_dtn_sw_status_st;  // Byte 309 - 368  | 60 byte
    bm_vmc_board_status_data_t   vmc_board_status_st;    // Byte 369 - 396  | 28 byte
} bm_engineering_cbit_report_t;                          // TOPLAM: 397 byte

// ============================================================================
// 2b. BM FLAG CBIT REPORT (msg_identifier = 6)
// ============================================================================
typedef union __attribute__((packed))
{
    struct
    {
        uint16_t rsvd_bits                    : 2; // 14-15
        uint16_t VSCPU_hreset_watchdog        : 1; // 13
        uint16_t VSCPU_hreset_soft_req        : 1; // 12
        uint16_t VSCPU_power_off_power_error  : 1; // 11
        uint16_t VSCPU_power_off_soft_req     : 1; // 10
        uint16_t FCPU_hreset_watchdog         : 1; // 9
        uint16_t FCPU_hreset_soft_req         : 1; // 8
        uint16_t FCPU_power_off_power_error   : 1; // 7
        uint16_t FCPU_power_off_soft_req      : 1; // 6
        uint16_t ES_power_off_power_error     : 1; // 5
        uint16_t ES_power_off_soft_req        : 1; // 4
        uint16_t VSW_power_off_power_error    : 1; // 3
        uint16_t VSW_power_off_soft_req       : 1; // 2
        uint16_t FSW_power_off_power_error    : 1; // 1
        uint16_t FSW_power_off_soft_req       : 1; // 0
    } bit;
    uint16_t bit_u16;
} bm_power_status_data_t;

typedef union __attribute__((packed))
{
    struct
    {
        uint16_t rsvd_bits              : 5; // 11-15
        uint16_t VSCPU_vtt_vref_p_good  : 1; // 10
        uint16_t VSCPU_xvdd_p_good      : 1; // 9
        uint16_t VSCPU_s2vdd_p_good     : 1; // 8
        uint16_t VSCPU_s1vdd_p_good     : 1; // 7
        uint16_t VSCPU_g1vdd_1v35_p_good: 1; // 6
        uint16_t VSCPU_1v8_p_good       : 1; // 5
        uint16_t VSCPU_3v3_p_good       : 1; // 4
        uint16_t VSCPU_5v_p_good        : 1; // 3
        uint16_t VSCPU_1v3_p_good       : 1; // 2
        uint16_t VSCPU_3v3_reg_p_good   : 1; // 1
        uint16_t VSCPU_12v_p_fault      : 1; // 0
    } bit;
    uint16_t bit_u16;
} bm_vcpu_power_goods_t;

typedef union __attribute__((packed))
{
    struct
    {
        uint16_t rsvd_bits              : 5; // 11-15
        uint16_t FCPU_vtt_vref_p_good   : 1; // 10
        uint16_t FCPU_xvdd_p_good       : 1; // 9
        uint16_t FCPU_s2vdd_p_good      : 1; // 8
        uint16_t FCPU_s1vdd_p_good      : 1; // 7
        uint16_t FCPU_g1vdd_1v35_p_good : 1; // 6
        uint16_t FCPU_1v8_p_good        : 1; // 5
        uint16_t FCPU_3v3_p_good        : 1; // 4
        uint16_t FCPU_5v_p_good         : 1; // 3
        uint16_t FCPU_1v3_p_good        : 1; // 2
        uint16_t FCPU_3v3_reg_p_good    : 1; // 1
        uint16_t FCPU_12v_p_fault       : 1; // 0
    } bit;
    uint16_t bit_u16;
} bm_fcpu_power_goods_t;

typedef union __attribute__((packed))
{
    struct
    {
        uint16_t rsvd_bits                             : 8; // 8-15
        uint16_t MMP_DTN_ES_FPGA_vddix_power_good      : 1; // 7
        uint16_t MMP_DTN_ES_FPGA_vdda_1V_power_good    : 1; // 6
        uint16_t MMP_DTN_ES_FPGA_1v8_power_good        : 1; // 5
        uint16_t MMP_DTN_ES_FPGA_2v5_power_good        : 1; // 4
        uint16_t MMP_DTN_ES_FPGA_vdd_1v_power_good     : 1; // 3
        uint16_t MMP_DTN_ES_FPGA_3v3_power_good        : 1; // 2
        uint16_t MMP_DTN_ES_FPGA_1v3_power_good        : 1; // 1
        uint16_t MMP_DTN_ES_FPGA_12v_power_fault       : 1; // 0
    } bit;
    uint16_t bit_u16;
} bm_mmp_dtn_es_fpga_power_goods_t;

typedef union __attribute__((packed))
{
    struct
    {
        uint16_t rsvd_bits                             : 8; // 8-15
        uint16_t VMP_DTN_SW_B_FPGA_vddix_power_good    : 1; // 7
        uint16_t VMP_DTN_SW_B_FPGA_vdda_1V_power_good  : 1; // 6
        uint16_t VMP_DTN_SW_B_FPGA_1v8_power_good      : 1; // 5
        uint16_t VMP_DTN_SW_B_FPGA_2v5_power_good      : 1; // 4
        uint16_t VMP_DTN_SW_B_FPGA_vdd_1v_power_good   : 1; // 3
        uint16_t VMP_DTN_SW_B_FPGA_3v3_power_good      : 1; // 2
        uint16_t VMP_DTN_SW_B_FPGA_1v3_power_good      : 1; // 1
        uint16_t VMP_DTN_SW_B_FPGA_12v_power_fault     : 1; // 0
    } bit;
    uint16_t bit_u16;
} bm_vmp_dtn_sw_b_fpga_power_goods_t;

typedef union __attribute__((packed))
{
    struct
    {
        uint16_t rsvd_bits                             : 8; // 8-15
        uint16_t VMP_DTN_SW_A_FPGA_vddix_power_good    : 1; // 7
        uint16_t VMP_DTN_SW_A_FPGA_vdda_1V_power_good  : 1; // 6
        uint16_t VMP_DTN_SW_A_FPGA_1v8_power_good      : 1; // 5
        uint16_t VMP_DTN_SW_A_FPGA_2v5_power_good      : 1; // 4
        uint16_t VMP_DTN_SW_A_FPGA_vdd_1v_power_good   : 1; // 3
        uint16_t VMP_DTN_SW_A_FPGA_3v3_power_good      : 1; // 2
        uint16_t VMP_DTN_SW_A_FPGA_1v3_power_good      : 1; // 1
        uint16_t VMP_DTN_SW_A_FPGA_12v_power_fault     : 1; // 0
    } bit;
    uint16_t bit_u16;
} bm_vmp_dtn_sw_a_fpga_power_goods_t;

typedef union __attribute__((packed))
{
    struct
    {
        uint16_t rsvd_bits                  : 2; // 14-15
        uint16_t VSCPU_core_power_not_ready : 1; // 13
        uint16_t VSCPU_core_power_fault     : 1; // 12
        uint16_t FCCPU_core_power_not_ready : 1; // 11
        uint16_t FCCPU_core_power_fault     : 1; // 10
        uint16_t VSCPU_clock_foof           : 1; // 9
        uint16_t VSCPU_clock_loss           : 1; // 8
        uint16_t FCCPU_clock_foof           : 1; // 7
        uint16_t FCCPU_clock_loss           : 1; // 6
        uint16_t DTN_ES_clock_foof          : 1; // 5
        uint16_t DTN_ES_clock_loss          : 1; // 4
        uint16_t DTN_VSW_clock_foof         : 1; // 3
        uint16_t DTN_VSW_clock_loss         : 1; // 2
        uint16_t DTN_FSW_clock_foof         : 1; // 1
        uint16_t DTN_FSW_clock_loss         : 1; // 0
    } bit;
    uint16_t bit_u16;
} ics_status_1_t;

typedef union __attribute__((packed))
{
    struct
    {
        uint16_t rsvd_bits  : 11; // 5-15
        uint16_t temp_ic_5  : 1;  // 4
        uint16_t temp_ic_4  : 1;  // 3
        uint16_t temp_ic_3  : 1;  // 2
        uint16_t temp_ic_2  : 1;  // 1
        uint16_t temp_ic_1  : 1;  // 0
    } bit;
    uint16_t bit_u16;
} ics_status_2_t;

typedef union __attribute__((packed))
{
    struct { uint16_t rsvd_bits : 15; uint16_t psm_power_primary_fault : 1; } bit;
    uint16_t bit_u16;
} psm_pwr_pri_flt_t;

typedef union __attribute__((packed))
{
    struct { uint16_t rsvd_bits : 15; uint16_t psm_power_secondary_fault : 1; } bit;
    uint16_t bit_u16;
} psm_pwr_sec_flt_t;

typedef union __attribute__((packed))
{
    struct { uint16_t rsvd_bits : 15; uint16_t psm_oring_ch : 1; } bit;
    uint16_t bit_u16;
} psm_oring_ch_t;

typedef union __attribute__((packed))
{
    struct { uint16_t rsvd_bits : 15; uint16_t psm_hold_up_not_ok : 1; } bit;
    uint16_t bit_u16;
} psm_hold_up_not_ok_t;

typedef struct __attribute__((packed))
{
    uint16_t red_event_flag_1; uint16_t red_event_flag_2; uint16_t red_event_flag_3;
    uint16_t red_event_flag_4; uint16_t red_event_flag_5; uint16_t red_event_flag_6;
    uint16_t red_event_flag_7; uint16_t red_event_flag_8; uint16_t red_event_flag_9;
    uint16_t red_event_flag_10;
} event_red_bitmaps_t;

typedef struct __attribute__((packed))
{
    uint16_t orange_event_flag_1;  uint16_t orange_event_flag_2;
    uint16_t orange_event_flag_3;  uint16_t orange_event_flag_4;
    uint16_t orange_event_flag_5;  uint16_t orange_event_flag_6;
    uint16_t orange_event_flag_7;  uint16_t orange_event_flag_8;
    uint16_t orange_event_flag_9;  uint16_t orange_event_flag_10;
    uint16_t orange_event_flag_11; uint16_t orange_event_flag_12;
} event_orange_bitmaps_t;

typedef struct __attribute__((packed))
{
    uint16_t yellow_event_flag_1;  uint16_t yellow_event_flag_2;
    uint16_t yellow_event_flag_3;  uint16_t yellow_event_flag_4;
    uint16_t yellow_event_flag_5;  uint16_t yellow_event_flag_6;
    uint16_t yellow_event_flag_7;  uint16_t yellow_event_flag_8;
    uint16_t yellow_event_flag_9;  uint16_t yellow_event_flag_10;
    uint16_t yellow_event_flag_11; uint16_t yellow_event_flag_12;
} event_yellow_bitmaps_t;

typedef struct __attribute__((packed))
{
    vmp_cmsw_header_t header_st;   // 0..10
    uint8_t           lru_id;      // 11
    uint8_t           comm_status; // 12

    bm_power_status_data_t              bm_power_status_st;               // 13..14
    bm_vcpu_power_goods_t               bm_vcpu_power_goods_st;           // 15..16
    bm_fcpu_power_goods_t               bm_fcpu_power_goods_st;           // 17..18
    bm_mmp_dtn_es_fpga_power_goods_t    bm_mmp_dtn_es_fpga_power_goods_st;// 19..20
    bm_vmp_dtn_sw_b_fpga_power_goods_t  bm_vmp_dtn_sw_b_fpga_power_goods_st;// 21..22
    bm_vmp_dtn_sw_a_fpga_power_goods_t  bm_vmp_dtn_sw_a_fpga_power_goods_st;// 23..24
    ics_status_1_t                      ics_status_1_st;                  // 25..26
    ics_status_2_t                      ics_status_2_st;                  // 27..28
    psm_pwr_pri_flt_t                   psm_pwr_pri_flt_st;               // 29..30
    psm_pwr_sec_flt_t                   psm_pwr_sec_flt_st;               // 31..32
    psm_oring_ch_t                      psm_oring_ch_st;                  // 33..34
    psm_hold_up_not_ok_t                psm_hold_up_not_ok_st;            // 35..36
    event_red_bitmaps_t                 event_red_bitmaps_st;             // 37..56
    event_orange_bitmaps_t              event_orange_bitmaps_st;          // 57..80
    event_yellow_bitmaps_t              event_yellow_bitmaps_st;          // 81..104
} bm_flag_cbit_report_t; // TOPLAM: 105 byte

_Static_assert(sizeof(bm_flag_cbit_report_t) == 105, "bm_flag_cbit_report_t size mismatch");

// ============================================================================
// ============================================================================

// 3. DTN ES CBIT MESSAGES
typedef struct __attribute__((packed)) 
{
    uint64_t reserved : 40;                                     // Byte 15  - 19   | 5 byte
    uint8_t  major;                                             // Byte 20         | 1 byte
    uint8_t  minor;                                             // Byte 21         | 1 byte
    uint8_t  bugfix;                                            // Byte 22         | 1 byte
} A664_ES_FW_VER_t;                                             // TOPLAM: 8 byte

// Wire format doğrulaması: dtn_es_monitoring_t 341 → 337 byte (wire'da 4B eksik).
// Eksiklik şuradan geliyor: A664_ES_TRANSCEIVER_TEMP wire'da u64 (8B) DEĞİL,
// float32 (4B) gönderiliyor. HW_TEMP ve HW_VCC_INT de wire'da float; u32
// yorumlanması saçma değerler üretiyordu.
typedef struct __attribute__((packed))
{
    A664_ES_FW_VER_t A664_ES_FW_VER;                            // 0   - 7    | 8 byte
    uint64_t A664_ES_DEV_ID;                                    // 8   - 15   | 8 byte
    uint64_t A664_ES_MODE;                                      // 16  - 23   | 8 byte
    uint64_t A664_ES_CONFIG_ID;                                 // 24  - 31   | 8 byte
    uint64_t A664_ES_BIT_STATUS;                                // 32  - 39   | 8 byte
    uint64_t A664_ES_CONFIG_STATUS;                             // 40  - 47   | 8 byte
    uint16_t A664_PTP_CONFIG_ID;                                // 48  - 49   | 2 byte
    uint8_t  A664_PTP_DEVICE_TYPE;                              // 50         | 1 byte
    uint8_t  A664_PTP_RC_STATUS;                                // 51         | 1 byte
    uint8_t  A664_PTP_PORT_A_SYNC;                              // 52         | 1 byte
    uint8_t  A664_PTP_PORT_B_SYNC;                              // 53         | 1 byte
    uint16_t A664_PTP_SYNC_VL_ID;                               // 54  - 55   | 2 byte
    uint16_t A664_PTP_REQ_VL_ID;                                // 56  - 57   | 2 byte
    uint16_t A664_PTP_RES_VL_ID;                                // 58  - 59   | 2 byte
    uint8_t  A664_PTP_TOD_NETWORK;                              // 60         | 1 byte
    float    A664_ES_HW_TEMP;                                   // 61  - 64   | 4 byte (wire: float32 BE)
    float    A664_ES_HW_VCC_INT;                                // 65  - 68   | 4 byte (wire: float32 BE)
    float    A664_ES_TRANSCEIVER_TEMP;                          // 69  - 72   | 4 byte (wire: float32 BE, u64 değil)
    uint64_t A664_ES_PORT_A_STATUS;                             // Byte 92  - 99   | 8 byte
    uint64_t A664_ES_PORT_B_STATUS;                             // Byte 100 - 107  | 8 byte
    uint64_t A664_ES_TX_INCOMING_COUNT;                         // Byte 108 - 115  | 8 byte
    uint64_t A664_ES_TX_A_OUTGOING_COUNT;                       // Byte 116 - 123  | 8 byte
    uint64_t A664_ES_TX_B_OUTGOING_COUNT;                       // Byte 124 - 131  | 8 byte
    uint64_t A664_ES_TX_VLID_DROP_COUNT;                        // Byte 132 - 139  | 8 byte
    uint64_t A664_ES_TX_LMIN_LMAX_DROP_COUNT;                   // Byte 140 - 147  | 8 byte
    uint64_t A664_ES_TX_MAX_JITTER_DROP_COUNT;                  // Byte 148 - 155  | 8 byte
    uint64_t A664_ES_RX_A_INCOMING_COUNT;                       // Byte 156 - 163  | 8 byte
    uint64_t A664_ES_RX_B_INCOMING_COUNT;                       // Byte 164 - 171  | 8 byte
    uint64_t A664_ES_RX_OUTGOING_COUNT;                         // Byte 172 - 179  | 8 byte
    uint64_t A664_ES_RX_A_VLID_DROP_COUNT;                      // Byte 180 - 187  | 8 byte
    uint64_t A664_ES_RX_A_LMIN_LMAX_DROP_COUNT;                 // Byte 188 - 195  | 8 byte
    uint64_t A664_ES_RX_A_NET_ERR_COUNT;                        // Byte 196 - 203  | 8 byte
    uint64_t A664_ES_RX_A_SEQ_ERR_COUNT;                        // Byte 204 - 211  | 8 byte
    uint64_t A664_ES_RX_A_CRC_ERROR_COUNT;                      // Byte 212 - 219  | 8 byte
    uint64_t A664_ES_RX_A_IP_CHECKSUM_ERROR_COUNT;              // Byte 220 - 227  | 8 byte
    uint64_t A664_ES_RX_B_VLID_DROP_COUNT;                      // Byte 228 - 235  | 8 byte
    uint64_t A664_ES_RX_B_LMIN_LMAX_DROP_COUNT;                 // Byte 236 - 243  | 8 byte
    uint64_t A664_ES_RX_B_SEQ_ERR_COUNT;                        // Byte 244 - 251  | 8 byte
    uint64_t A664_ES_RX_B_NET_ERR_COUNT;                        // Byte 252 - 259  | 8 byte
    uint64_t A664_ES_RX_B_CRC_ERROR_COUNT;                      // Byte 260 - 267  | 8 byte
    uint64_t A664_ES_RX_B_IP_CHECKSUM_ERROR_COUNT;              // Byte 268 - 275  | 8 byte
    uint64_t A664_BSP_TX_PACKET_COUNT;                          // Byte 276 - 283  | 8 byte
    uint64_t A664_BSP_TX_BYTE_COUNT;                            // Byte 284 - 291  | 8 byte
    uint64_t A664_BSP_TX_ERROR_COUNT;                           // Byte 292 - 299  | 8 byte
    uint64_t A664_BSP_RX_PACKET_COUNT;                          // Byte 300 - 307  | 8 byte
    uint64_t A664_BSP_RX_BYTE_COUNT;                            // Byte 308 - 315  | 8 byte
    uint64_t A664_BSP_RX_ERROR_COUNT;                           // Byte 316 - 323  | 8 byte
    uint64_t A664_BSP_RX_MISSED_FRAME_COUNT;                    // Byte 324 - 331  | 8 byte
    uint64_t A664_BSP_VER;                                      // Byte 332 - 339  | 8 byte
    uint64_t A664_ES_VENDOR_TYPE;                               // Byte 340 - 347  | 8 byte
    uint64_t A664_ES_BSP_QUEUING_RX_VL_PORT_DROP_COUNT;         // Byte 348 - 355  | 8 byte
} dtn_es_monitoring_t;                                          // TOPLAM: 337 byte (wire, HW_VCC_INT çıkarıldı)

typedef struct __attribute__((packed)) 
{
    vmp_cmsw_header_t   header_st;                              // Byte 0   - 10   | 11 byte
    uint8_t             lru_id;                                 // Byte 11         | 1 byte
    uint8_t             side_type;                              // Byte 12         | 1 byte
    uint8_t             network_type;                           // Byte 13         | 1 byte
    uint8_t             comm_status;                            // Byte 14         | 1 byte
    dtn_es_monitoring_t dtn_es_monitoring_st;                   // Byte 15  - 351  | 337 byte (wire)
} dtn_es_cbit_report_t;                                         // TOPLAM: 352 byte (wire)

// ============================================================================
// ============================================================================

// 4. DTN SW CBIT MESSAGES
//
// Wire format (gerçek pakette doğrulandı):
//   ön-header (15 B)  + status (57 B) + port[8] (8×124 B) = 1064 B
// Dokümandaki struct (61 + 132×8) ile farklar:
//   - TRANSCEIVER_TEMP, SHARED_TRANSCEIVER_TEMP → uint64 DEĞİL, float32 (BE).
//   - Status'taki VOLTAGE ve TEMPERATURE alanları uint16 değil, float32.
//   - Port struct 16 u64 counter yerine 15 u64 counter içeriyor
//     (son counter'ın "SPEED" olduğu kanıtlandı; eksik olan counter
//     tanımsız, aşağıda `reserved_u64_unknown` olarak işaretlendi —
//     VMC tarafıyla senkron sağlandığında gerçek adı konacak).
typedef struct __attribute__((packed))
{
    uint64_t A664_SW_TX_TOTAL_COUNT;                            // 0   - 7    | 8 byte
    uint64_t A664_SW_RX_TOTAL_COUNT;                            // 8   - 15   | 8 byte
    float    A664_SW_TRANSCEIVER_TEMP;                          // 16  - 19   | 4 byte (wire: float BE)
    float    A664_SW_SHARED_TRANSCEIVER_TEMP;                   // 20  - 23   | 4 byte
    uint16_t A664_SW_DEV_ID;                                    // 24  - 25   | 2 byte
    uint8_t  A664_SW_PORT_COUNT;                                // 26         | 1 byte
    uint8_t  A664_SW_TOKEN_BUCKET;                              // 27         | 1 byte
    uint8_t  A664_SW_MODE;                                      // 28         | 1 byte
    uint8_t  A664_SW_BE_MAC_UPDATE;                             // 29         | 1 byte
    uint8_t  A664_SW_BE_UPSTREAM_MODE;                          // 30         | 1 byte
    uint64_t A664_SW_FW_VER;                                    // 31  - 38   | 8 byte
    uint64_t A664_SW_EMBEDEED_ES_FW_VER;                        // 39  - 46   | 8 byte
    float    A664_SW_VOLTAGE;                                   // 47  - 50   | 4 byte (wire: float BE)
    float    A664_SW_TEMPERATURE;                               // 51  - 54   | 4 byte (wire: float BE)
    uint16_t A664_SW_CONFIGURATION_ID;                          // 55  - 56   | 2 byte
} dtn_sw_status_mon_t;                                          // TOPLAM: 57 byte

typedef struct __attribute__((packed))
{
    uint16_t A664_SW_PORT_ID;                                   // 0   - 1    | 2 byte
    uint8_t  A664_SW_PORT_i_BIT_STATUS;                         // 2          | 1 byte
    uint8_t  A664_SW_PORT_i_STATUS;                             // 3          | 1 byte
    uint64_t A664_SW_PORT_i_CRC_ERR_COUNT;                      // 4   - 11   | 8 byte
    uint64_t A664_SW_PORT_i_MIN_VL_FRAME_ERR_COUNT;             // 12  - 19   | 8 byte
    uint64_t A664_SW_PORT_i_MAX_VL_FRAME_ERR_COUNT;             // 20  - 27   | 8 byte
    uint64_t A664_SW_PORT_i_TRAFFIC_POLCY_DROP_COUNT;           // 28  - 35   | 8 byte
    uint64_t A664_SW_PORT_i_BE_COUNT;                           // 36  - 43   | 8 byte
    uint64_t A664_SW_PORT_i_TX_COUNT;                           // 44  - 51   | 8 byte
    uint64_t A664_SW_PORT_i_RX_COUNT;                           // 52  - 59   | 8 byte
    uint64_t A664_SW_PORT_i_VL_SOURCE_ERR_COUNT;                // 60  - 67   | 8 byte
    uint64_t A664_SW_PORT_i_MAX_DELAY_ERR_COUNT;                // 68  - 75   | 8 byte
    uint64_t A664_SW_PORT_i_VLID_DROP_COUNT;                    // 76  - 83   | 8 byte
    uint64_t A664_SW_PORT_i_UNDEF_MAC_COUNT;                    // 84  - 91   | 8 byte
    uint64_t A664_SW_PORT_i_HIGH_PRTY_QUE_OVRFLW_COUNT;         // 92  - 99   | 8 byte
    uint64_t A664_SW_PORT_i_LOW_PRTY_QUE_OVRFLW_COUNT;          // 100 - 107  | 8 byte
    // NOT: Dokümandaki A664_SW_PORT_i_BE_QUE_OVRFLW_COUNT bu konumda
    // bekleniyordu ama wire formatta yok — sahadan doğrulanana kadar
    // reserved olarak kalıyor. (VMC kodu gelince gerçek adı konacak.)
    uint64_t A664_SW_PORT_i_MAX_DELAY;                          // 108 - 115  | 8 byte
    uint64_t A664_SW_PORT_i_SPEED;                              // 116 - 123  | 8 byte (wire son alan = SPEED, doğrulandı)
} dtn_sw_port_mon_t;                                            // TOPLAM: 124 byte (8 port × 124 = 992 byte)

typedef struct __attribute__((packed))
{
    dtn_sw_status_mon_t status;                                 // 0   - 56   | 57 byte
    dtn_sw_port_mon_t   port[8];                                // 57  - 1048 | 992 byte
} dtn_sw_monitoring_t;                                          // TOPLAM: 1049 byte

typedef struct __attribute__((packed))
{
    vmp_cmsw_header_t   header_st;                              // Byte 0    - 10    | 11 byte
    uint8_t             lru_id;                                 // Byte 11           | 1 byte
    uint8_t             side_type;                              // Byte 12           | 1 byte
    uint8_t             network_type;                           // Byte 13           | 1 byte
    uint8_t             comm_status;                            // Byte 14           | 1 byte
    dtn_sw_monitoring_t dtn_sw_monitoring_st;                   // Byte 15   - 1063  | 1049 byte
} dtn_sw_cbit_report_t;                                         // TOPLAM: 1064 byte

// ============================================================================
//
// CPU USAGE  --  FLCS VL =   // VS VL = 
//
